
error.technical.genericException = this is a generic exception message {0}, 500, ERROR, View system resources
error.technical.genericTechnicalException = this is a generic technical exception. Please contact {0} and {1}., 500, ERROR, Resolution: Please review the system logs

error.generic_checked= this is a generic message {0}, 500, WARN, View system logs looking for AbstractExceptions
error.business= this is a generic business message {0}, 500, WARN, View system logs for BusinessExceptions
error.businessUnchecked= this is a generic business message {0}, 500, WARN, View system logs for BusinessUncheckedExceptions

error.technical.generic_runtime= this is a generic message {0}, 500, WARN, View system logs looking for AbstractRuntimeExceptions
error.technical.soap.portofault= this is a generic porto fault message {0}, 500, WARN, View system logs looking for PortoFaultExceptions
error.technical.integration= this is a generic integration message {0}, 500, WARN, View system logs looking for IntegrationExceptions
error.technical.environment= this is a generic message {0}, 500, WARN, View system logs for EnvironmentExceptions

error.technical.wepapplicationexception= this is a WebApplicationException, 0, ERROR, View system logs looking for WebApplicationException

module.grupoUsuario.notFound=Nao Encontrado, 404, WARN, Informe um grupo de usuario existente.
module.grupoUsuario.conflicts=Identificacao conflitante, 409, WARN, Informe uma identificacao igual no local e no objeto.

erro.rest.api.entrada_invalida=Par\u00E2metros de entrada inv\u00E1lidos. Verifique se os par\u00E2metros informados est\u00E3o corretos.
erro.rest.api.score.mais_recente=Falha ao consultar dados do Score mais recente.
erro.rest.api.score.consultar_score_desconto=Falha ao consultar dados de Score para Desconto.

erro.rest.api.score.score_desconto_nao_encontrado=Nenhum score foi encontrado para os par\u00E2metros informados.
erro.rest.api.cliente.cadastro=Falha ao cadastrar o cliente.
erro.rest.api.cliente.nao.encontrado=Cliente n\u00E3o encontrado

erro.rest.api.apolice.cadastro=Falha ao gravar Score da ap\u00F3lice

erro.rest.api.viagem.cadastro.arquivo=Falha ao gravar arquivo de viagens.

erro.rest.api.limite.consulta.excedido=A consulta realizada excedeu o limite de registros. Altere o filtro para restringir os dados retornados.

erro.rest.api.email.ja.cadastrado.usuario=O E-mail informado est\u00E1 sendo utilizando por outro usu\u00E1rio 
erro.rest.api.cpf.ja.cadastrado.usuario=O CPF informado est\u00E1 sendo utilizando por outro usu\u00E1rio 
erro.rest.api.idexterno.ja.cadastrado.usuario=O ID Externo informado est\u00E1 sendo utilizando por outro usu\u00E1rio 
erro.rest.api.generico=Falha ao executar servico 
erro.rest.api.id_externo.invalido.cadastrado.usuario=O ID Externo do usu\u00E1rio informado est\u00E1 inv\u00E1lido

erro.rest.api.pessoa.cadastro=Falha ao cadastrar a pessoa.
erro.rest.api.pessoa.nao.encontrada=Pessoa n\u00E3o encontrada.
erro.rest.api.id_baseline.ja.cadastrado.pessoa=O ID Baseline informado est\u00E1 sendo utilizando por outra pessoa. 
erro.rest.api.codigo_pessoa.ja.cadastrado.pessoa=O C\u00f3digo Pessoa informado est\u00E1 sendo utilizando por outra pessoa. 
erro.rest.api.id_externo.ja.cadastrado.pessoa=O E-mail informado est\u00E1 sendo utilizando por outra pessoa.
erro.rest.api.id_parceiro.invalido.cadastrado.pessoa=O ID Parceiro da pessoa informada est\u00E1 inv\u00E1lido.


#Campos obrigatorio
error.codigo.pessoa.telemetria=Codigo Pessoa Telemetria obrigat\u00f3rio